36. OSY AXIS

In [2]:
import pandas as pd

In [4]:
bank_users = pd.read_csv('bank_users.csv')

In [6]:
bank_users

,first_name,last_name,email,bank_account,born_year,city
0,Shawn,Gotts,sgotts0@newsvine.com,58.0,NaN,Jinchuan
1,Sergeant,Linsey,slinsey1@qq.com,70.0,2007.0,Tāngāil
2,Ambrosio,Gorton,agorton2@google.es,48.0,2000.0,Zhushan Chengguanzhen
3,Gram,Steanyng,gsteanyng3@google.fr,92.0,1970.0,Hongxing
4,Britt,Cockaday,bcockaday4@t.co,78.0,1985.0,Nangabulik
...,...,...,...,...,...,...
195,Franz,Oppy,foppy5f@shutterfly.com,90.0,2020.0,Bílina Kyselka
196,Adolphus,Labbati,alabbati5g@yellowbook.com,56.0,1984.0,Berlin
197,Aurelea,Cordery,acordery5h@furl.net,NaN,1992.0,Veshnyaki
198,Armstrong,Laughren,alaughren5i@yahoo.co.jp,87.0,1983.0,Detik Satu
199,Henrietta,Peckitt,hpeckitt5j@multiply.com,NaN,1967.0,Phú Lộc

In [10]:
my_series = pd.Series([10, 20, 30])
my_series

0    10
1    20
2    30
dtype: int64

In [12]:
my_series.sum()

60

In [16]:
bank_users_bc_y = bank_users[['bank_account', 'born_year']]
bank_users_bc_y

     bank_account  born_year
0            58.0        NaN
1            70.0     2007.0
2            48.0     2000.0
3            92.0     1970.0
4            78.0     1985.0
..            ...        ...
195          90.0     2020.0
196          56.0     1984.0
197           NaN     1992.0
198          87.0     1983.0
199           NaN     1967.0

[200 rows x 2 columns]

In [18]:
bank_users_bc_y.sum()

bank_account     10088.0
born_year       349768.0
dtype: float64

In [20]:
bank_users_bc_y.sum(1)

0        58.0
1      2077.0
2      2048.0
3      2062.0
4      2063.0
        ...
195    2110.0
196    2040.0
197    1992.0
198    2070.0
199    1967.0
Length: 200, dtype: float64

In [24]:
bank_users_bc_y.sum(axis='index')

bank_account     10088.0
born_year       349768.0
dtype: float64

In [26]:
bank_users_bc_y.sum(axis='columns')

0        58.0
1      2077.0
2      2048.0
3      2062.0
4      2063.0
        ...
195    2110.0
196    2040.0
197    1992.0
198    2070.0
199    1967.0
Length: 200, dtype: float64

In [34]:
my_series.sum(axis=0) # axis 1 nemuze protoze nejsou 2 sloupce!

60